Revit 2024 API
EnergyAnalysisConstruction.Roughness Property
 The roughness value of the construction.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public int Roughness { get; }
Visual Basic
Public ReadOnly Property Roughness As Integer
	Get
Visual C++
public:
property int Roughness {
	int get ();
}
See Also
EnergyAnalysisConstruction Class
Autodesk.Revit.DB.Analysis Namespace